#include <stdio.h>

void demo01(){
    int a = 9, b = 7, c;
    c = a&b;
    printf("a=%d\nb=%d\nc=%d",a,b,c);
}

void demo02(){
    int a = 9, b = 7, c;
    c = a|b;
    printf("a=%d\nb=%d\nc=%d",a,b,c);
}

void demo03(){
    int a = 9, b = 5, c = 1;
    printf("a=%d\nb=%d\nc=%d",~a,~b,~c);
}

void demo04(){
    int a = 1;
    printf("a=%d",a<<2);
}

void demo05(){
    int a = 9; // 0000 1001
    printf("a=%d",a>>2); // 0000 10
}

void demo06(){
    int a = 9, b = 5, c;
    c = a^b;
    //   0000 1001
    // ^ 0000 0101
    printf("a=%d\nb=%d\nc=%d",a,b,c); // 0000 1100
}

void demo07(){
    //  -3 的原码是 10000000 00000000 00000000 00000011
    //  -3 的反码是 11111111 11111111 11111111 11111100
    //  -3 的补码是 11111111 11111111 11111111 11111101
    int a = 0b11111111111111111111111111111101, b = 0b00000011, c = 2;
    printf("a=%d\nb=%d\nc=%d",a,b,c);
}

void demo08(){
    // -9 的原码 10000000 00000000 00000000 00001001
    // -9 的反码 11111111 11111111 11111111 11110110
    // -9 的补码 11111111 11111111 11111111 11110111
    // 5 的原码反码补码00000000 00000000 00000000 00000101
    int a = 0b11111111111111111111111111110111;
    int b = 5, c;
    c = a|b;
    //  11111111111111111111111111110111
    // |00000000000000000000000000000101
    // ---------------------------------
    // 11111111111111111111111111110111
    // 反码 10000000 00000000 00000000 00001000
    // 补码 10000000 00000000 00000000 00001001
    // 等于-9
    printf("a=%d\nb=%d\nc=%d",a,b,c);
}

// 判断特定位的值
void demo09(){
    char mark = 0b00000010;
    char a =    0b00000010;
    char b = a&mark;
    printf("倒数第二位是为%d",!!b);
}

// 设置特定位的值为1
void demo10(){
    char mark = 0b00000010;
    char a =    0b00000001;
    printf("设置前 倒数第二位是为%d\n",!!(a&mark));
    
    char b = a|mark;
    printf("设置后的值是%d\n",b);
    printf("设置后 倒数第二位是为%d\n",!!(b&mark));
}

// 设置特定位的值为0
void demo11(){
    char mark = 0b00000010;
    char rMark = ~mark;
    char a =    0b00000010;
    printf("设置前的值是%d\n",a);
    printf("设置前 倒数第二位是为%d\n",!!(a&mark));
    
    char b = a&rMark;
    printf("设置后的值是%d\n",b);
    printf("设置后 倒数第二位是为%d\n",!!(b&mark));
}

int main(){
    demo11();
}
